Autodesk.Revit.UI.ExternalDataManagerTool.GetChildCommandIds
Obtains the sub menu of the item.
Returns:
The array of child command ids or an empty array when none have been set.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerTool.SetChildCommandIds(System.Collections.Generic.IList{Autodesk.Revit.UI.ExternalDataManagerCommandId})
Sets the sub menu of the item
childCommandIds:
The list of child command ids to associate with the tool.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerTool.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalDataManagerTool.CommandId
The id of the root command represented by this tool item.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerTool.#ctor(Autodesk.Revit.UI.ExternalDataManagerCommandId)
Constructor
commandId:
The command id of the tool.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerTool.#ctor(Autodesk.Revit.UI.ExternalDataManagerTool)
Create a copy of the object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerTool
Represents an item of a content tool.
Remarks:
A tool item represents either a single actionable command (leaf)
or a container that owns one or more child commands (parent/branch).
Tool items are returned by IExternalDataManagerServer.getContentTools and
are used to populate the context-sensitive content tools panel or right-click menus.
A typical workflow is:
1. The server constructs a tool item providing the id of the root command.
2. If the root command has sub-commands the server fills ChildCommandIds
with the ids of those sub-commands.
3. Revit uses the ids to look-up command metadata in ExternalDataManagerCommand
and builds the appropriate UI.
All user-visible strings associated with commands (name, tooltip) should be
localized by the server.
Since:
2027